---
kind: type
id: T:Autodesk.Revit.DB.ConnectionValidationInfo
source: html/f9acd482-6c59-12ef-342c-7b6a3ab7f867.htm
---
# Autodesk.Revit.DB.ConnectionValidationInfo

This object contains information about fabrication connection validations.

## Syntax (C#)
```csharp
public class ConnectionValidationInfo : IDisposable
```